#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```
terraform
module.repository_lib_template["rust"].data.github_team.owner: Reading...
module.repository["website"].data.github_team.owner: Reading...
module.repository_svc_template["python"].github_repository.repository: Refreshing state... [id=svc-template-python]
module.repository_tf["onboarding"].github_repository.repository: Refreshing state... [id=tf-onboarding]
module.repository_svc_template["typescript"].github_repository.repository: Refreshing state... [id=svc-template-typescript]
module.repository["benchmarks"].data.github_team.owner: Reading...
module.repository_tf["github"].data.github_team.owner: Reading...
module.repository_rust_svc["storage"].data.github_team.owner: Reading...
module.repository_tf["github"].github_repository.repository: Refreshing state... [id=tf-github]
module.repository_svc_template["rust"].github_repository.repository: Refreshing state... [id=svc-template-rust]
module.repository_rust_lib["router"].data.github_team.owner: Reading...
module.repository_rust_svc["scheduler"].data.github_team.owner: Reading...
module.repository["clabot-config"].data.github_team.owner: Reading...
module.repository["tools"].data.github_team.owner: Reading...
module.repository["cla-bot"].data.github_team.owner: Reading...
module.repository["website"].data.github_team.owner: Read complete after 4s [id=5490296]
module.repository_tf["onboarding"].data.github_team.owner: Reading...
module.repository_lib_template["rust"].data.github_team.owner: Read complete after 4s [id=6311795]
module.repository_svc_template["typescript"].data.github_team.owner: Reading...
module.repository["tools"].data.github_team.owner: Read complete after 5s [id=6203057]
module.repository["cla-bot"].github_repository.repository: Refreshing state... [id=cla-bot]
module.repository["benchmarks"].data.github_team.owner: Read complete after 6s [id=6311795]
module.repository_lib_template["rust"].github_repository.repository: Refreshing state... [id=lib-template-rust]
module.repository_tf["github"].data.github_team.owner: Read complete after 6s [id=6029505]
module.repository["tools"].github_repository.repository: Refreshing state... [id=tools]
module.repository_rust_svc["storage"].data.github_team.owner: Read complete after 7s [id=6311795]
module.repository["clabot-config"].github_repository.repository: Refreshing state... [id=clabot-config]
module.repository_rust_lib["router"].data.github_team.owner: Read complete after 7s [id=6311795]
module.repository["website"].github_repository.repository: Refreshing state... [id=website]
module.repository_rust_svc["scheduler"].data.github_team.owner: Read complete after 7s [id=6311795]
module.repository_svc_template["rust"].data.github_team.owner: Reading...
module.repository["clabot-config"].data.github_team.owner: Read complete after 7s [id=6029505]
module.repository_svc_template["python"].data.github_team.owner: Reading...
module.repository_tf["github"].github_repository_webhook.map["discord"]: Refreshing state... [id=372087606]
module.repository_tf["onboarding"].github_repository_webhook.map["discord"]: Refreshing state... [id=372087608]
module.repository_svc_template["rust"].github_repository_webhook.map["discord"]: Refreshing state... [id=373104840]
module.repository_svc_template["typescript"].github_repository_webhook.map["discord"]: Refreshing state... [id=373104835]
module.repository["cla-bot"].data.github_team.owner: Read complete after 7s [id=6029505]
module.repository_svc_template["python"].github_repository_webhook.map["discord"]: Refreshing state... [id=373104833]
module.repository_svc_template["typescript"].github_branch.branch["develop"]: Refreshing state... [id=svc-template-typescript:develop]
module.repository_svc_template["python"].github_branch.branch["develop"]: Refreshing state... [id=svc-template-python:develop]
module.repository_svc_template["rust"].github_branch.branch["develop"]: Refreshing state... [id=svc-template-rust:develop]
module.repository_tf["onboarding"].github_branch_default.default: Refreshing state... [id=tf-onboarding]
module.repository_tf["github"].github_branch_default.default: Refreshing state... [id=tf-github]
module.repository_lib_template["rust"].github_repository_webhook.map["discord"]: Refreshing state... [id=373104862]
module.repository_tf["onboarding"].data.github_team.owner: Read complete after 7s [id=6029505]
module.repository_lib_template["rust"].github_branch.branch["develop"]: Refreshing state... [id=lib-template-rust:develop]
module.repository_svc_template["typescript"].data.github_team.owner: Read complete after 7s [id=6311795]
module.repository_lib_template["rust"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:lib-template-rust]
module.repository["cla-bot"].github_team_repository.maintainer["devops"]: Refreshing state... [id=6029505:cla-bot]
module.repository["clabot-config"].github_team_repository.maintainer["devops"]: Refreshing state... [id=6029505:clabot-config]
module.repository["tools"].github_team_repository.maintainer["drone-engineering"]: Refreshing state... [id=6203057:tools]
module.repository["website"].github_team_repository.maintainer["webdevelopers"]: Refreshing state... [id=5490296:website]
module.repository["website"].github_branch.branch["staging"]: Refreshing state... [id=website:staging]
module.repository_rust_svc["storage"].github_repository.repository: Refreshing state... [id=svc-storage]
module.repository_rust_svc["scheduler"].github_repository.repository: Refreshing state... [id=svc-scheduler]
module.repository_tf["onboarding"].github_team_repository.maintainer["devops"]: Refreshing state... [id=6029505:tf-onboarding]
module.repository_tf["onboarding"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:tf-onboarding]
module.repository_svc_template["rust"].data.github_team.owner: Read complete after 6s [id=6311795]
module.repository_tf["github"].github_team_repository.maintainer["devops"]: Refreshing state... [id=6029505:tf-github]
module.repository_svc_template["python"].data.github_team.owner: Read complete after 6s [id=6311795]
module.repository_tf["github"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:tf-github]
module.repository_rust_lib["router"].github_repository.repository: Refreshing state... [id=lib-router]
module.repository_svc_template["typescript"].github_branch_default.default: Refreshing state... [id=svc-template-typescript]
module.repository_svc_template["python"].github_branch_default.default: Refreshing state... [id=svc-template-python]
module.repository_svc_template["rust"].github_branch_default.default: Refreshing state... [id=svc-template-rust]
module.repository_tf["onboarding"].github_repository_file.CODEOWNERS: Refreshing state... [id=tf-onboarding/.github/CODEOWNERS]
module.repository_tf["github"].github_repository_file.CODEOWNERS: Refreshing state... [id=tf-github/.github/CODEOWNERS]
module.repository_lib_template["rust"].github_branch_default.default: Refreshing state... [id=lib-template-rust]
module.repository_svc_template["typescript"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:svc-template-typescript]
module.repository_svc_template["python"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:svc-template-python]
module.repository_svc_template["rust"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:svc-template-rust]
module.repository["cla-bot"].github_branch_default.default: Refreshing state... [id=cla-bot]
module.repository["clabot-config"].github_branch_default.default: Refreshing state... [id=clabot-config]
module.repository["tools"].github_branch_default.default: Refreshing state... [id=tools]
module.repository["website"].github_branch_default.default: Refreshing state... [id=website]
module.repository_rust_svc["storage"].github_branch.branch["develop"]: Refreshing state... [id=svc-storage:develop]
module.repository_rust_svc["storage"].github_repository_webhook.map["discord"]: Refreshing state... [id=372953439]
module.repository_rust_svc["scheduler"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:svc-scheduler]
module.repository_rust_svc["scheduler"].github_branch.branch["develop"]: Refreshing state... [id=svc-scheduler:develop]
module.repository_rust_svc["scheduler"].github_repository_webhook.map["discord"]: Refreshing state... [id=372953430]
module.repository_rust_svc["storage"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:svc-storage]
module.repository_rust_lib["router"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:lib-router]
module.repository_rust_lib["router"].github_repository_webhook.map["discord"]: Refreshing state... [id=372953444]
module.repository_rust_lib["router"].github_branch.branch["develop"]: Refreshing state... [id=lib-router:develop]
module.repository_svc_template["rust"].github_repository_file.CODEOWNERS: Refreshing state... [id=svc-template-rust/.github/CODEOWNERS]
module.repository_svc_template["typescript"].github_repository_file.CODEOWNERS: Refreshing state... [id=svc-template-typescript/.github/CODEOWNERS]
module.repository_svc_template["python"].github_repository_file.CODEOWNERS: Refreshing state... [id=svc-template-python/.github/CODEOWNERS]
module.repository_lib_template["rust"].github_repository_file.CODEOWNERS: Refreshing state... [id=lib-template-rust/.github/CODEOWNERS]
module.repository["website"].github_repository_file.CODEOWNERS: Refreshing state... [id=website/.github/CODEOWNERS]
module.repository["cla-bot"].github_repository_file.CODEOWNERS: Refreshing state... [id=cla-bot/.github/CODEOWNERS]
module.repository["clabot-config"].github_repository_file.CODEOWNERS: Refreshing state... [id=clabot-config/.github/CODEOWNERS]
module.repository["tools"].github_repository_file.CODEOWNERS: Refreshing state... [id=tools/.github/CODEOWNERS]
module.repository_rust_svc["storage"].github_branch_default.default: Refreshing state... [id=svc-storage]
module.repository_rust_svc["scheduler"].github_branch_default.default: Refreshing state... [id=svc-scheduler]
module.repository_tf["github"].github_branch_protection.all["tf-github"]: Refreshing state... [id=BPR_kwDOG6VIns4BpnEQ]
module.repository_tf["github"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOG6VIns4BpLGe]
module.repository_rust_lib["router"].github_branch_default.default: Refreshing state... [id=lib-router]
module.repository_rust_svc["scheduler"].github_repository_file.CODEOWNERS: Refreshing state... [id=svc-scheduler/.github/CODEOWNERS]
module.repository_rust_svc["storage"].github_repository_file.files[".github/workflows/editorconfig_check.yml"]: Refreshing state... [id=svc-storage/.github/workflows/editorconfig_check.yml]
module.repository_rust_svc["storage"].github_repository_file.CODEOWNERS: Refreshing state... [id=svc-storage/.github/CODEOWNERS]
module.repository_rust_svc["storage"].github_repository_file.files[".cargo-husky/hooks/pre-push"]: Refreshing state... [id=svc-storage/.cargo-husky/hooks/pre-push]
module.repository_rust_svc["storage"].github_repository_file.files[".cargo/config.toml"]: Refreshing state... [id=svc-storage/.cargo/config.toml]
module.repository_rust_svc["storage"].github_repository_file.files[".editorconfig"]: Refreshing state... [id=svc-storage/.editorconfig]
module.repository_rust_svc["storage"].github_repository_file.files[".cargo-husky/hooks/README.md"]: Refreshing state... [id=svc-storage/.cargo-husky/hooks/README.md]
module.repository_rust_svc["storage"].github_repository_file.files[".github/workflows/python_ci.yml"]: Refreshing state... [id=svc-storage/.github/workflows/python_ci.yml]
module.repository_rust_svc["storage"].github_repository_file.files[".github/workflows/rust_ci.yml"]: Refreshing state... [id=svc-storage/.github/workflows/rust_ci.yml]
module.repository_rust_svc["storage"].github_repository_file.files[".gitignore"]: Refreshing state... [id=svc-storage/.gitignore]
module.repository_rust_svc["storage"].github_repository_file.files[".cargo-husky/hooks/pre-commit"]: Refreshing state... [id=svc-storage/.cargo-husky/hooks/pre-commit]
module.repository_rust_svc["scheduler"].github_repository_file.files[".cargo-husky/hooks/pre-push"]: Refreshing state... [id=svc-scheduler/.cargo-husky/hooks/pre-push]
module.repository_rust_svc["scheduler"].github_repository_file.files[".cargo-husky/hooks/README.md"]: Refreshing state... [id=svc-scheduler/.cargo-husky/hooks/README.md]
module.repository_rust_svc["scheduler"].github_repository_file.files[".cargo-husky/hooks/pre-commit"]: Refreshing state... [id=svc-scheduler/.cargo-husky/hooks/pre-commit]
module.repository_rust_svc["scheduler"].github_repository_file.files[".github/workflows/editorconfig_check.yml"]: Refreshing state... [id=svc-scheduler/.github/workflows/editorconfig_check.yml]
module.repository_rust_svc["scheduler"].github_repository_file.files[".gitignore"]: Refreshing state... [id=svc-scheduler/.gitignore]
module.repository_rust_svc["scheduler"].github_repository_file.files[".cargo/config.toml"]: Refreshing state... [id=svc-scheduler/.cargo/config.toml]
module.repository_rust_svc["scheduler"].github_repository_file.files[".editorconfig"]: Refreshing state... [id=svc-scheduler/.editorconfig]
module.repository_rust_svc["scheduler"].github_repository_file.files[".github/workflows/python_ci.yml"]: Refreshing state... [id=svc-scheduler/.github/workflows/python_ci.yml]
module.repository_rust_svc["scheduler"].github_repository_file.files[".github/workflows/rust_ci.yml"]: Refreshing state... [id=svc-scheduler/.github/workflows/rust_ci.yml]
module.repository_svc_template["python"].github_branch_protection.all["svc-template-python"]: Refreshing state... [id=BPR_kwDOHrbxrc4BqmXq]
module.repository_svc_template["rust"].github_branch_protection.protection["develop"]: Refreshing state... [id=BPR_kwDOHn-JXc4BqmXz]
module.repository_svc_template["rust"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHn-JXc4Bqprl]
module.repository_svc_template["rust"].github_branch_protection.all["svc-template-rust"]: Refreshing state... [id=BPR_kwDOHn-JXc4BqmXy]
module.repository_svc_template["typescript"].github_branch_protection.all["svc-template-typescript"]: Refreshing state... [id=BPR_kwDOHtu-d84BqmXw]
module.repository_svc_template["typescript"].github_branch_protection.protection["develop"]: Refreshing state... [id=BPR_kwDOHtu-d84BqmXu]
module.repository_svc_template["typescript"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHtu-d84BqmXx]
module.repository_svc_template["python"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHrbxrc4BqmXr]
module.repository_svc_template["python"].github_branch_protection.protection["develop"]: Refreshing state... [id=BPR_kwDOHrbxrc4BqmXs]
module.repository_lib_template["rust"].github_branch_protection.protection["develop"]: Refreshing state... [id=BPR_kwDOHwJLh84BqmYF]
module.repository_lib_template["rust"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHwJLh84BqmYD]
module.repository_lib_template["rust"].github_branch_protection.all["lib-template-rust"]: Refreshing state... [id=BPR_kwDOHwJLh84BqmYC]
module.repository["website"].github_branch_protection.all["website"]: Refreshing state... [id=BPR_kwDOGdyvzM4BpnEJ]
module.repository["website"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOGdyvzM4BiRcN]
module.repository["website"].github_branch_protection.protection["staging"]: Refreshing state... [id=BPR_kwDOGdyvzM4BiRcL]
module.repository["cla-bot"].github_branch_protection.all["cla-bot"]: Refreshing state... [id=BPR_kwDOHTAbhc4BpnEE]
module.repository["tools"].github_branch_protection.all["tools"]: Refreshing state... [id=BPR_kwDOHn-Jf84BpnEA]
module.repository["cla-bot"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHTAbhc4BmmRb]
module.repository["tools"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHn-Jf84BmmRe]
module.repository_rust_lib["router"].github_repository_file.files[".editorconfig"]: Refreshing state... [id=lib-router/.editorconfig]
module.repository_rust_lib["router"].github_repository_file.CODEOWNERS: Refreshing state... [id=lib-router/.github/CODEOWNERS]
module.repository_rust_lib["router"].github_repository_file.files[".github/workflows/editorconfig_check.yml"]: Refreshing state... [id=lib-router/.github/workflows/editorconfig_check.yml]
module.repository_rust_lib["router"].github_repository_file.files[".gitignore"]: Refreshing state... [id=lib-router/.gitignore]
module.repository_rust_lib["router"].github_repository_file.files[".github/workflows/python_ci.yml"]: Refreshing state... [id=lib-router/.github/workflows/python_ci.yml]
module.repository_rust_lib["router"].github_repository_file.files[".cargo-husky/hooks/pre-commit"]: Refreshing state... [id=lib-router/.cargo-husky/hooks/pre-commit]
module.repository_rust_lib["router"].github_repository_file.files[".cargo/config.toml"]: Refreshing state... [id=lib-router/.cargo/config.toml]
module.repository_rust_lib["router"].github_repository_file.files[".github/workflows/rust_ci.yml"]: Refreshing state... [id=lib-router/.github/workflows/rust_ci.yml]
module.repository_rust_lib["router"].github_repository_file.files[".cargo-husky/hooks/README.md"]: Refreshing state... [id=lib-router/.cargo-husky/hooks/README.md]
module.repository_rust_lib["router"].github_repository_file.files[".cargo-husky/hooks/pre-push"]: Refreshing state... [id=lib-router/.cargo-husky/hooks/pre-push]
module.repository_rust_svc["storage"].github_branch_protection.all["svc-storage"]: Refreshing state... [id=BPR_kwDOHyi9jc4BqieI]
module.repository_rust_svc["storage"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHyi9jc4BqieF]
module.repository_rust_svc["storage"].github_branch_protection.protection["develop"]: Refreshing state... [id=BPR_kwDOHyi9jc4BqieG]
module.repository_rust_svc["scheduler"].github_branch_protection.all["svc-scheduler"]: Refreshing state... [id=BPR_kwDOHyi9hc4Bqidq]
module.repository_rust_svc["scheduler"].github_branch_protection.protection["develop"]: Refreshing state... [id=BPR_kwDOHyi9hc4Bqidr]
module.repository_rust_svc["scheduler"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHyi9hc4Bqidt]
module.repository_rust_lib["router"].github_branch_protection.all["lib-router"]: Refreshing state... [id=BPR_kwDOHyi9o84BqieE]
module.repository_rust_lib["router"].github_branch_protection.protection["develop"]: Refreshing state... [id=BPR_kwDOHyi9o84Bqidv]
module.repository_rust_lib["router"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHyi9o84Bqid1]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.repository["website"].github_branch.branch["staging"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"216b7332ca9e425e4d42427db8be016274fedf042d8bd59fb0c3da77dbdf3e37\"" -> "W/\"50b01d7b1cdcd7b43d0bd91357e35ba04eaa18e693873157c8564cd06adc1b8f\""
        id            = "website:staging"
        # (5 unchanged attributes hidden)
    }

  # module.repository_lib_template["rust"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"13e1c930c3852d9e0c345829c31efd3868db05326d144d28b7b9b870fc2996c0\"" -> "W/\"644bdb1bd29a9438c07f197e1249dbb553101e4d0c8b4e4524158b9db73605db\""
        id            = "lib-template-rust:develop"
        # (6 unchanged attributes hidden)
    }

  # module.repository_rust_lib["router"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"c3319ec2aec2bb0a25d99272d18b828ed5aa8e0a2d3a9d39d9198f4f520981c1\"" -> "W/\"403a484d75f154e33e5ec9a15c8e7b8bb69c226514969f615b69527a54e72050\""
        id            = "lib-router:develop"
        # (6 unchanged attributes hidden)
    }

  # module.repository_rust_svc["scheduler"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"168bbb65dd4998df16b65308a36f45d641e04d63ad1e2b22c2b1afcf7db6a8bf\"" -> "W/\"fc6d5d89f1765cf3370fcd19eb3e6c8e0a1a2d790c4bec038ed049aaabebfdf3\""
        id            = "svc-scheduler:develop"
        # (6 unchanged attributes hidden)
    }

  # module.repository_rust_svc["storage"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"80e7b2a485c5a16a56a41a4b717bf5d3b5191a35b48f1907d4424f2c1592dbf6\"" -> "W/\"d3442300f0052bc1fa24b08004a5bf5f1bcadc65f89e6b3229b544618495f8c0\""
        id            = "svc-storage:develop"
        # (6 unchanged attributes hidden)
    }

  # module.repository_svc_template["python"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"c3020a37df554c802a4b42074c525c10a37c8fee613a58f42a57a8e49aea0116\"" -> "W/\"c999b0c5d526e023c9ef8e4efc74ea8eeb30535572c97cb3ce55517f5138348d\""
        id            = "svc-template-python:develop"
        # (6 unchanged attributes hidden)
    }

  # module.repository_svc_template["rust"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"0ef81fd890f10e94431111088d88602a67066adb84c3a8c5027888a8f1170b0e\"" -> "W/\"03c7dce40ff16ff69a512959227577d91e415057b4cf84a9924abadb98b4d3db\""
        id            = "svc-template-rust:develop"
        # (6 unchanged attributes hidden)
    }

  # module.repository_svc_template["typescript"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"fa0592c82f902adec62e83f62788852dd7cf506a6c8d685d5150110f4190a3d6\"" -> "W/\"53440c1f4a36ffedfbdd369b81e55edf9fc1046f24059960471bc5038d445316\""
        id            = "svc-template-typescript:develop"
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.repository["benchmarks"].github_branch_default.default will be created
  + resource "github_branch_default" "default" {
      + branch     = "main"
      + id         = (known after apply)
      + repository = "benchmarks"
    }

  # module.repository["benchmarks"].github_branch_protection.all["benchmarks"] will be created
  + resource "github_branch_protection" "all" {
      + allows_deletions                = true
      + allows_force_pushes             = true
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = "benchmarks"
      + require_conversation_resolution = false
      + require_signed_commits          = true
      + required_linear_history         = false
    }

  # module.repository["benchmarks"].github_branch_protection.protection["main"] will be created
  + resource "github_branch_protection" "protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = "benchmarks"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.repository["benchmarks"].github_repository.repository will be created
  + resource "github_repository" "repository" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "In-house benchmarks for various frameworks."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = true
      + has_projects           = true
      + has_wiki               = true
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + name                   = "benchmarks"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.repository["benchmarks"].github_repository_file.CODEOWNERS will be created
  + resource "github_repository_file" "CODEOWNERS" {
      + branch              = "main"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            * @Arrow-air/services
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "benchmarks"
      + sha                 = (known after apply)
    }

  # module.repository["benchmarks"].github_team_repository.maintainer["services"] will be created
  + resource "github_team_repository" "maintainer" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "benchmarks"
      + team_id    = "services"
    }

  # module.repository["cla-bot"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHTAbhc4BmmRb"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["tools"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHn-Jf84BmmRe"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["website"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOGdyvzM4BiRcN"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["website"].github_branch_protection.protection["staging"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOGdyvzM4BiRcL"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_lib_template["rust"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHwJLh84BqmYF"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_lib_template["rust"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHwJLh84BqmYD"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_lib["router"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9o84Bqidv"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_lib["router"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9o84Bqid1"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["scheduler"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9hc4Bqidr"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["scheduler"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9hc4Bqidt"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["storage"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9jc4BqieG"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["storage"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9jc4BqieF"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["python"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHrbxrc4BqmXs"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["python"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHrbxrc4BqmXr"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["rust"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHn-JXc4BqmXz"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["rust"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHn-JXc4Bqprl"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["typescript"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHtu-d84BqmXu"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["typescript"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHtu-d84BqmXx"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_tf["github"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOG6VIns4BpLGe"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 6 to add, 19 to change, 0 to destroy.

Changes to Outputs:
  ~ repositories = {
      + benchmarks    = {
          + branch         = {}
          + branch_default = {
              + branch     = "main"
              + id         = (known after apply)
              + repository = "benchmarks"
            }
          + repository     = {
              + allow_auto_merge                        = false
              + allow_merge_commit                      = true
              + allow_rebase_merge                      = true
              + allow_squash_merge                      = true
              + archive_on_destroy                      = null
              + archived                                = false
              + auto_init                               = true
              + branches                                = (known after apply)
              + default_branch                          = (known after apply)
              + delete_branch_on_merge                  = true
              + description                             = "In-house benchmarks for various frameworks."
              + etag                                    = (known after apply)
              + full_name                               = (known after apply)
              + git_clone_url                           = (known after apply)
              + gitignore_template                      = null
              + has_downloads                           = null
              + has_issues                              = true
              + has_projects                            = true
              + has_wiki                                = true
              + homepage_url                            = null
              + html_url                                = (known after apply)
              + http_clone_url                          = (known after apply)
              + id                                      = (known after apply)
              + ignore_vulnerability_alerts_during_read = null
              + is_template                             = false
              + license_template                        = null
              + name                                    = "benchmarks"
              + node_id                                 = (known after apply)
              + pages                                   = []
              + private                                 = (known after apply)
              + repo_id                                 = (known after apply)
              + ssh_clone_url                           = (known after apply)
              + svn_url                                 = (known after apply)
              + template                                = []
              + topics                                  = null
              + visibility                              = "public"
              + vulnerability_alerts                    = true
            }
        }
      ~ website       = {
          ~ branch         = {
              ~ staging = {
                  ~ etag          = "W/\"216b7332ca9e425e4d42427db8be016274fedf042d8bd59fb0c3da77dbdf3e37\"" -> "W/\"50b01d7b1cdcd7b43d0bd91357e35ba04eaa18e693873157c8564cd06adc1b8f\""
                    id            = "website:staging"
                    # (6 unchanged elements hidden)
                }
            }
            # (2 unchanged elements hidden)
        }
        # (3 unchanged elements hidden)
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```
</details>
*Pusher: @ServiceDog, Action: `pull_request`*